In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

1. Merging

In [2]:
dframe1 = DataFrame({'Key':['X','Z','Y','X','X','Y'], 'data_1':np.arange(6)})

In [3]:
dframe1

  Key  data_1
0   X       0
1   Z       1
2   Y       2
3   X       3
4   X       4
5   Y       5

In [4]:
dframe2 = DataFrame({'Key':['X','Z','Q'], 'data_2':[1, 2, 3]})

In [5]:
dframe2

  Key  data_2
0   X       1
1   Z       2
2   Q       3

In [6]:
pd.merge(dframe1,dframe2)

  Key  data_1  data_2
0   X       0       1
1   X       3       1
2   X       4       1
3   Z       1       2

In [7]:
pd.merge(dframe1,dframe2,on='Key')

  Key  data_1  data_2
0   X       0       1
1   X       3       1
2   X       4       1
3   Z       1       2

In [8]:
pd.merge(dframe1,dframe2,on='Key',how='left')

  Key  data_1  data_2
0   X       0     1.0
1   Z       1     2.0
2   Y       2     NaN
3   X       3     1.0
4   X       4     1.0
5   Y       5     NaN

In [9]:
pd.merge(dframe1,dframe2,on='Key',how='right')

  Key  data_1  data_2
0   X     0.0       1
1   X     3.0       1
2   X     4.0       1
3   Z     1.0       2
4   Q     NaN       3

In [10]:
df_left = DataFrame({'Key_1':['SF','SF','LA'],
                     'Key_2':['one','two','one'],
                     'left_data':[10, 20, 30]})

In [11]:
df_right = DataFrame({'Key_1':['SF','SF','LA','LA'],
                      'Key_2':['one','one','one','two'],
                      'right_data':[40, 50, 60,70]})

In [12]:
df_left

  Key_1 Key_2  left_data
0    SF   one         10
1    SF   two         20
2    LA   one         30

In [13]:
df_right

  Key_1 Key_2  right_data
0    SF   one          40
1    SF   one          50
2    LA   one          60
3    LA   two          70

In [14]:
pd.merge(df_left,df_right, on=['Key_1', 'Key_2'], how='outer')

  Key_1 Key_2  left_data  right_data
0    SF   one       10.0        40.0
1    SF   one       10.0        50.0
2    SF   two       20.0         NaN
3    LA   one       30.0        60.0
4    LA   two        NaN        70.0

2. Merging on Index

In [15]:
df_left = DataFrame({'key':['X','Y','Z', 'X', 'Y'],
                     'data':[0, 1, 2, 3, 4]})

df_right = DataFrame({'group_data':[10, 20]},index=['X', 'Y'])

In [16]:
pd.merge(df_left, df_right, left_on='key', right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

3. Concatenate

In [17]:
arr1 = np.arange(9).reshape(3,3)

In [18]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [19]:
np.concatenate([arr1,arr1])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [20]:
np.concatenate([arr1,arr1], axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [21]:
data_frame = DataFrame({'col_1': np.arange(5),
                       'col_2': np.random.normal(size=5),
                       'col_3': np.random.normal(size=5)})

In [22]:
data_frame

   col_1     col_2     col_3
0      0  0.895862 -0.262017
1      1 -0.228369  0.348521
2      2  0.024680  0.086304
3      3  1.735071  1.364772
4      4  0.930048  0.230684

In [23]:
ser = Series(np.random.normal(size=5))

In [24]:
ser

0    2.258823
1    0.321796
2   -0.806680
3    1.368588
4   -0.573129
dtype: float64

In [25]:
pd.concat([data_frame,ser])

   col_1     col_2     col_3         0
0    0.0  0.895862 -0.262017       NaN
1    1.0 -0.228369  0.348521       NaN
2    2.0  0.024680  0.086304       NaN
3    3.0  1.735071  1.364772       NaN
4    4.0  0.930048  0.230684       NaN
0    NaN       NaN       NaN  2.258823
1    NaN       NaN       NaN  0.321796
2    NaN       NaN       NaN -0.806680
3    NaN       NaN       NaN  1.368588
4    NaN       NaN       NaN -0.573129

In [26]:
pd.concat([data_frame,ser], axis=1)

   col_1     col_2     col_3         0
0      0  0.895862 -0.262017  2.258823
1      1 -0.228369  0.348521  0.321796
2      2  0.024680  0.086304 -0.806680
3      3  1.735071  1.364772  1.368588
4      4  0.930048  0.230684 -0.573129

In [27]:
d1 = DataFrame(np.random.randn(4,3), columns=['A','B','C'])
d2 = DataFrame(np.random.randn(3,3), columns=['A','Z','D'])

In [28]:
d1

          A         B         C
0  0.477420  1.738700 -1.280648
1  0.972811  0.912025  1.208690
2 -0.197136 -1.771002  0.393965
3  0.339549 -0.178720 -0.911631

In [29]:
d2

          A         Z         D
0  0.786393  1.486985 -0.948151
1  0.630679 -3.044686  0.087309
2 -1.963862 -0.410325  0.948495

In [30]:
pd.concat([d1,d2])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         B         C         D         Z
0  0.477420  1.738700 -1.280648       NaN       NaN
1  0.972811  0.912025  1.208690       NaN       NaN
2 -0.197136 -1.771002  0.393965       NaN       NaN
3  0.339549 -0.178720 -0.911631       NaN       NaN
0  0.786393       NaN       NaN -0.948151  1.486985
1  0.630679       NaN       NaN  0.087309 -3.044686
2 -1.963862       NaN       NaN  0.948495 -0.410325

In [31]:
pd.concat([d1,d2], ignore_index=True)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         B         C         D         Z
0  0.477420  1.738700 -1.280648       NaN       NaN
1  0.972811  0.912025  1.208690       NaN       NaN
2 -0.197136 -1.771002  0.393965       NaN       NaN
3  0.339549 -0.178720 -0.911631       NaN       NaN
4  0.786393       NaN       NaN -0.948151  1.486985
5  0.630679       NaN       NaN  0.087309 -3.044686
6 -1.963862       NaN       NaN  0.948495 -0.410325

4. Combine DataFrame

In [33]:
ser1 = Series([2, np.nan, 4, np.nan, 6, np.nan], index=['Q','R','S','T','U','V'])
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [34]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64, index=['Q','R','S','T','U','V'])
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

In [35]:
Series(np.where(pd.isnull(ser1),ser2,ser1), index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [36]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

5. Reshaping

In [37]:
df = pd.read_csv('nfl_data.csv')

In [38]:
df = df.head(10)

In [39]:
df

,Rank,Team,GP,Won,Lost,Tied,Pct,First NFH Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,37",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North
7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East
8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West

In [42]:
df_stack = df.stack()

In [43]:
df_stack

0  Rank                                  1
   Team                     Dallas Cowboys
   GP                                  882
   Won                                 502
   Lost                                374
   Tied                                  6
   Pct                               0.573
   First NFH Season                   1960
   Division                       NFC East
1  Rank                                  2
   Team                  Green Bay Packers
   GP                                1,336
   Won                                 737
   Lost                                562
   Tied                                 37
   Pct                               0.565
   First NFH Season                   1921
   Division                      NFC North
2  Rank                                  3
   Team                      Chicago Bears
   GP                                 1,37
   Won                                 749
   Lost                                579
   Tied                                 42
   Pct                               0.562
   First NFH Season                   1920
   Division                      NFC North
3  Rank                                  4
   Team                     Miami Dolphins
   GP                                  800
                              ...
6  Pct                               0.541
   First NFH Season                   1996
   Division                      AFC North
7  Rank                                  8
   Team                    New York Giants
   GP                                1,305
   Won                                 687
   Lost                                585
   Tied                                 33
   Pct                               0.539
   First NFH Season                   1925
   Division                       NFC East
8  Rank                                  9
   Team                     Denver Broncos
   GP                                  884
   Won                                 470
   Lost                                404
   Tied                                 10
   Pct                               0.537
   First NFH Season                   1960
   Division                       AFC West
9  Rank                                 10
   Team                San Francisco 49ers
   GP                                1,002
   Won                                 528
   Lost                                460
   Tied                                 14
   Pct                               0.534
   First NFH Season                   1950
   Division                       NFC West
Length: 90, dtype: object